Revit 2024 API
SaveModifiedLinksOptions Enumeration
 Class giving options when saving linked files which have been modified in-memory by shared coordinates operations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum SaveModifiedLinksOptions
Visual Basic
Public Enumeration SaveModifiedLinksOptions
Visual C++
public enum class SaveModifiedLinksOptions
Members
Member name | Description
SaveLinks |  Any modified linked files will be saved.
DoNotSaveLinks |  Any modified linked files will not be saved. The links will return to their previous position the next time the file is loaded.
DisableSharedPositioning |  Any modified linked files will not be saved. Additionally, stop using shared positioning with any modified files.
See Also
Autodesk.Revit.DB Namespace